#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
#include <stdbool.h>

//2025.08.02力扣网刷题
//哪种连续子字符串更长——字符串、第242场周赛——简单
//给你一个二进制字符串 s 。如果字符串中由 1 组成的 最长 连续子字符串 严格长于 由 0 组成的 最长 连续子字符串，返回 true ；否则，返回 false 。
//例如，s = "110100010" 中，由 1 组成的最长连续子字符串的长度是 2 ，由 0 组成的最长连续子字符串的长度是 3 。
//注意，如果字符串中不存在 0 ，此时认为由 0 组成的最长连续子字符串的长度是 0 。字符串中不存在 1 的情况也适用此规则。
//示例 1：
//输入：s = "1101"
//输出：true
//解释：
//由 1 组成的最长连续子字符串的长度是 2："1101"
//由 0 组成的最长连续子字符串的长度是 1："1101"
//由 1 组成的子字符串更长，故返回 true 。
//示例 2：
//输入：s = "111000"
//输出：false
//解释：
//由 1 组成的最长连续子字符串的长度是 3："111000"
//由 0 组成的最长连续子字符串的长度是 3："111000"
//由 1 组成的子字符串不比由 0 组成的子字符串长，故返回 false 。
//示例 3：
//输入：s = "110100010"
//输出：false
//解释：
//由 1 组成的最长连续子字符串的长度是 2："110100010"
//由 0 组成的最长连续子字符串的长度是 3："110100010"
//由 1 组成的子字符串不比由 0 组成的子字符串长，故返回 false 。
//提示：
//1 <= s.length <= 100
//s[i] 不是 '0' 就是 '1'

bool checkZeroOnes(char* s) {
	int max_one = 0, max_zero = 0;
	int tmp_1 = 0, tmp_0 = 0;
	if (s[0] == '1') {
		tmp_1 += 1;
	}
	else {
		tmp_0 += 1;
	}
	for (int i = 1; s[i]; i++) {
		if (s[i] == s[i - 1] && s[i] == '0') {
			tmp_0 += 1;
		}
		else if (s[i] == s[i - 1] && s[i] == '1') {
			tmp_1 += 1;
		}
		else if (s[i] != s[i - 1]) {
			tmp_1 = 1;
			tmp_0 = 1;
		}
		if (tmp_1 > max_one) {
			max_one = tmp_1;
		}
		if (tmp_0 > max_zero) {
			max_zero = tmp_0;
		}
	}
	if (tmp_1 > max_one) {
		max_one = tmp_1;
	}
	if (tmp_0 > max_zero) {
		max_zero = tmp_0;
	}
	return max_one > max_zero;
}