#include <stdio.h>

//2026.09.28力扣网刷题
//1614. 括号的最大嵌套深度——中级工程师、栈、字符串、括号序列、第210场周赛——简单
//给定 有效括号字符串 s，返回 s 的 嵌套深度。嵌套深度是嵌套括号的 最大 数量。
//示例 1：
//输入：s = "(1+(2*3)+((8)/4))+1"
//输出：3
//解释：数字 8 在嵌套的 3 层括号中。
//示例 2：
//输入：s = "(1)+((2))+(((3)))"
//输出：3
//解释：数字 3 在嵌套的 3 层括号中。
//示例 3：
//输入：s = "()(())((()()))"
//输出：3
//提示：
//1 <= s.length <= 100
//s 由数字 0 - 9 和字符 '+'、'-'、'*'、'/'、'('、')' 组成
//题目数据保证括号字符串 s 是 有效的括号字符串

int maxDepth(char* s) {
	int top = 0, ans = 0;
	for (int i = 0; s[i]; i++) {
		if (s[i] == '(') {
			top += 1;
		}
		else if (s[i] == ')') {
			if (top > ans) {
				ans = top;
			}
			top -= 1;
		}
	}
	return ans;
}