#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include <assert.h>

//2024.08.06力扣网刷题
//学生分数的最小差值——数组、排序、滑动窗口——简单
//给你一个 下标从 0 开始 的整数数组 nums ，其中 nums[i] 表示第 i 名学生的分数。另给你一个整数 k 。
//从数组中选出任意 k 名学生的分数，使这 k 个分数间 最高分 和 最低分 的 差值 达到 最小化 。
//返回可能的 最小差值 。
//示例 1：
//输入：nums = [90], k = 1
//输出：0
//解释：选出 1 名学生的分数，仅有 1 种方法：
//- [90] 最高分和最低分之间的差值是 90 - 90 = 0
//可能的最小差值是 0
//示例 2：
//输入：nums = [9, 4, 1, 7], k = 2
//输出：2
//解释：选出 2 名学生的分数，有 6 种方法：
//- [9, 4, 1, 7] 最高分和最低分之间的差值是 9 - 4 = 5
//- [9, 4, 1, 7] 最高分和最低分之间的差值是 9 - 1 = 8
//- [9, 4, 1, 7] 最高分和最低分之间的差值是 9 - 7 = 2
//- [9, 4, 1, 7] 最高分和最低分之间的差值是 4 - 1 = 3
//- [9, 4, 1, 7] 最高分和最低分之间的差值是 7 - 4 = 3
//- [9, 4, 1, 7] 最高分和最低分之间的差值是 7 - 1 = 6
//可能的最小差值是 2
//提示：
//1 <= k <= nums.length <= 1000
//0 <= nums[i] <= 10^5

//方法一：选择排序
int minimumDifference1(int* nums, int numsSize, int k) {
	if (numsSize == 1)
		return 0;
	for (int i = 0; i < numsSize - 1; i++) {
		for (int j = i + 1; j < numsSize; j++) {
			if (nums[j] > nums[i]) {
				int tmp = nums[j];
				nums[j] = nums[i];
				nums[i] = tmp;
			}
		}
	}
	int min = nums[0] - nums[k - 1];
	for (int i = 0; i <= numsSize - k; i++) {
		if (min > nums[i] - nums[i + k - 1])
			min = nums[i] - nums[i + k - 1];
	}
	return min;
}

//方法二：qsort排序
int cmp(const void* p1, const void* p2) {
	return *(int*)p2 - *(int*)p1;
}
int minimumDifference(int* nums, int numsSize, int k) {
	if (numsSize == 1)
		return 0;
	qsort(nums, numsSize, sizeof(int), cmp);
	int min = nums[0] - nums[k - 1];
	for (int i = 0; i <= numsSize - k; i++) {
		if (min > nums[i] - nums[i + k - 1])
			min = nums[i] - nums[i + k - 1];
	}
	return min;
}

void test() {
	//int nums[] = { 41900,69441,94407,37498,20299,10856,36221,2231,54526,79072,84309,76765,92282,13401,44698,17586,98455,47895,98889,65298,32271,23801,83153,12186,7453,79460,67209,54576,87785,47738,40750,31265,77990,93502,50364,75098,11712,80013,24193,35209,56300,85735,3590,24858,6780,50086,87549,7413,90444,12284,44970,39274,81201,43353,75808,14508,17389,10313,90055,43102,18659,20802,70315,48843,12273,78876,36638,17051,20478 };
	int nums[] = { 11181,23291,24520,92567,19530,12631,11048,37325,36730,45935,43785,85701,60558,4847,88701,27809,76264,73637,50367,48998,31556,28617,60992,76542,71383,22035,95023,89149,54342,12712,93885,1243,5682,75211,60667,68766,94505,67043,98893,80977,6367,13446,64482,13383,71717,22432,49079,52101,61754,98448,42679,35519,523,93809,91584,12763,49377,42131,9990,23324,22887,91557,21905,49635,14267 };
	int len = 65;
	int k = 39;
	printf("%d \n", minimumDifference(nums, len, k));
}

int main() {
	test();
	return 0;
}