#include <stdio.h>
#include <stdlib.h>
#include <assert.h>


//2026.02.28力扣网刷题
//461. 汉明距离——位运算——简单
//两个整数之间的 汉明距离 指的是这两个数字对应二进制位不同的位置的数目。
//给你两个整数 x 和 y，计算并返回它们之间的汉明距离。
//示例 1：
//输入：x = 1, y = 4
//输出：2
//解释：
//1   (0 0 0 1)
//4   (0 1 0 0)
//↑   ↑
//上面的箭头指出了对应二进制位不同的位置。
//示例 2：
//输入：x = 3, y = 1
//输出：1
//提示：
//0 <= x, y <= 2^31 - 1
//注意：本题与 2220. 转换数字的最少位翻转次数 相同。

int hammingDistance(int x, int y) {
	int ans = 0, bit1 = 0, bit2 = 0;
	while (x || y) {
		bit1 = x & 1;
		bit2 = y & 1;
		if (bit1 != bit2) {
			ans++;
		}
		x >>= 1;
		y >>= 1;
	}
	return ans;
}